In [35]:
import pandas as pd
import pandas as pd
import pymysql
from sqlalchemy import create_engine
from getpass import getpass

password = getpass()
database = 'sakila'
connection_string = 'mysql+pymysql://root:'+password+'@localhost/'+database
engine = create_engine(connection_string)


def rental_month(engine, month:int, year:int) -> pd.DataFrame:
    query = f"""
        SELECT * FROM rental
        WHERE DATE_FORMAT(rental_date,'%%m') = {month}
        AND
        DATE_FORMAT(rental_date,'%%Y') = {year}
        """
    data = pd.read_sql_query(query, engine)
    return data



def rental_count_month(dataframe_function, month, year):
    dataframe = dataframe_function(engine, month, year)
    data1= dataframe.groupby('customer_id')['rental_id'].count()
    data_final = pd.merge(dataframe, data1, on='customer_id')
    return data_final.rename(columns={'rental_id_x':'rental_id','rental_id_y':f"rental_{month}_{year}"})

def compare_rentals(df: pd.DataFrame, df2: pd.DataFrame):
    final_dataframe = pd.concat([df, df2])
    data_count = df['rental_id'].count()
    data2_count = df2['rental_id'].count()
    final_dataframe['difference'] = abs(data2_count - data_count)
    return final_dataframe
rental_count_month(dataframe_function=rental_month,month=5,year=2005)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,rental_5_2005
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,3
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,1
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,5
...,...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53,7
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53,3
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53,6
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53,2
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53,1

In [36]:
data = rental_month(engine, 5, 2005)
data2 = rental_month(engine, 6, 2005)

In [56]:
final_dataframe = pd.concat([data, data2])
data_count = data['rental_id'].count()
data2_count = data2['rental_id'].count()
final_dataframe['difference'] = abs(data2_count - data_count)
final_dataframe

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,difference
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,1155
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,1155
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,1155
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,1155
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,1155
...,...,...,...,...,...,...,...,...
2306,3465,2005-06-21 22:10:01,1488,510,2005-06-30 21:35:01,1,2006-02-15 21:30:53,1155
2307,3466,2005-06-21 22:13:33,371,226,2005-06-25 21:01:33,2,2006-02-15 21:30:53,1155
2308,3467,2005-06-21 22:19:25,729,543,2005-06-27 00:03:25,2,2006-02-15 21:30:53,1155
2309,3468,2005-06-21 22:43:45,2899,100,2005-06-30 01:49:45,1,2006-02-15 21:30:53,1155
2310,3469,2005-06-21 22:48:59,4087,181,2005-06-28 19:32:59,1,2006-02-15 21:30:53,1155

In [29]:
data_1 = data.groupby('customer_id')['rental_id'].count().reset_index()

In [33]:
data_final = pd.merge(data, data_1, on='customer_id')
data_final.rename(columns={'rental_id_x':'rental_id','rental_id_y':'counter'})

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,counter
0,11496,2006-02-14 15:16:03,2047,155,None,1,2006-02-15 21:30:53,2
1,11541,2006-02-14 15:16:03,2026,335,None,1,2006-02-15 21:30:53,1
2,11563,2006-02-14 15:16:03,1545,83,None,1,2006-02-15 21:30:53,1
3,11577,2006-02-14 15:16:03,4106,219,None,2,2006-02-15 21:30:53,1
4,11593,2006-02-14 15:16:03,817,99,None,1,2006-02-15 21:30:53,1
...,...,...,...,...,...,...,...,...
177,15862,2006-02-14 15:16:03,925,215,None,1,2006-02-15 21:30:53,1
178,15867,2006-02-14 15:16:03,837,505,None,2,2006-02-15 21:30:53,1
179,15875,2006-02-14 15:16:03,3611,41,None,1,2006-02-15 21:30:53,1
180,15894,2006-02-14 15:16:03,4416,168,None,1,2006-02-15 21:30:53,1
181,15966,2006-02-14 15:16:03,4472,374,None,1,2006-02-15 21:30:53,1